 {
 	"data" : [
	 	{
			"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/611887778962094",
			"hero_name":"Anti-Mage",
			"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/antimage_vert.jpg",
			"hero_role":"Melee - Carry - Escape - Nuker",
			"hero_detail":"",
			"hero_overview":"လက္ရွိ Meta အရေတာ့ Anti-Mage ဟာ Battle Fury ကုိ ဦးစြာ Farm ျပီး Battle ေရွာင္ကာ Farm တဲ့ ပုံစံနဲ႕ ကစားလ်က္ရွိပါတယ္။ Anti-Mage ဟာ BAT (Base Attack Time) 1.45 ရွိတဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ ပုံမွန္ Agility Carry ေတြနဲ႕ ယွဥ္ရင္ မ်ားစြာ အားသာခ်က္ ရွိပါတယ္။ BAT ဟာ Attack Speed Increase Amount ကုိ စားျပီး တြက္ခ်က္ ရတဲ့ ကိန္းဂဏန္းျဖစ္လုိ႔ ဂဏန္းေသးေလ ပုိေကာင္းေလျဖစ္ပါတယ္။ (ေယဘုယ် Hero တစ္ေကာင္ရဲ႕ BAT ဟာ 1.7 ခန္႔ရွိပါတယ္။) ဒါေၾကာင့္ ပုံမွန္ Hero ေတြက Attack Speed Item ထည့္ျပီး ျမန္လာတဲ့ Attack Speed ထက္ Anti-Mage က ပုိမ်ားတဲ့ Attack Speed ကုိ ရရွိေနရျခင္းျဖစ္ပါတယ္။ ဒါေၾကာင့္ပဲ Anti-Mage ကုိ Attribute Item ေတြ ျဖစ္တဲ့ Manta-Style, Butterfly စတဲ့ Agility ကုိ တုိးေစတဲ့ Item ေတြကုိ ေရြးခ်ယ္ရျခင္းပဲျဖစ္ပါတယ္။ Attack Speed ျမန္တဲ့အျပင္ Agility ဟာ Anti-Mage ရဲ႕ Base Armor ကုိ တုိးေစတဲ့အျပင္ Illusion Unit ေတြရဲ႕ Damage Output ကုိပါတုိးေစမွာျဖစ္ပါတယ္။ ယခင္ Frozen Throne Dota တုန္းက Anti-Mage ကုိ Power Tread + Vanguard + Offering + Sange and Yasha ပုံစံနဲ႕ အေစာပိုင္း Team Fight ဝင္တဲ့ ပုံစံဟာ ျမင္ေနရၾက ျဖစ္ခဲ့ေပမယ့္ တရုတ္ႏုိင္ငံရဲ႕ သက္ရွိထင္ရွား Legendary Carry Player BurNIng ရဲ႕ ေသသပ္လြန္းတဲ့ Last Hit ေတြကေန ရရွိလာတဲ့ Battle Fury တစ္လက္ဟာ ပြဲအေျပာင္းအလဲ မည္မွ် ျဖစ္သြားေစသလဲဆုိတာကုိ အားလုံးသိရွိျပီးခဲ့တဲ့ ေနာက္မွာေတာ့ Anti-Mage ရဲ႕ လက္ရွိ Meta ဟာ Battle Fury, Offering, Manta Style, Fly, Bkb, Heart ဆုိတဲ့ ေယဘုယ် Build မွာ လည္ပတ္သြားခဲ့ပါတယ္။Anti-Mage အတြက္ေတာ့ တျခား Hero ေတြထက္ အားသာတဲ့ အခ်က္က သူ႔ရဲ႕ Blink ပဲ ျဖစ္ပါတယ္။ Anti-Mage ဟာ မိမိ အသင္းသားေတြနဲ႕အတူ Smoke ကုိ အသုံးျပဳကာ တစ္ဖက္အသင္းရဲ႕ Jungle ကုိ ထုိးေဖာက္ျပီးေနာက္ က်န္ရွိတဲ့ မိမိအသင္းသားမ်ားက Battle ဖန္တီးျပီး အာရုံလႊဲေနခ်ိန္မွာ လြတ္ေနတဲ့ လမ္းကုိ RAT တဲ့ ကစားကြက္ကုိလည္း အေျခအေနအရ အသုံးျပဳႏုိင္ပါေသးတယ္။ ဒီလုိတုိက္ခုိက္ဖုိ႔အတြက္ ျဖစ္ႏုိင္ရင္ မိမိအသင္းသားေတြထဲမွာ Ganker ေတြ မ်ားမ်ား ရွိေနဖုိ႔ လုိအပ္ပါတယ္။ Manta Style ဟာ Antimage ရဲ႕ တတိယေျမာက္ အေရးအၾကီးဆုံး Item ထဲမွာ ပါဝင္ပါတယ္။ Enemy အသင္းက တုိက္ခုိက္မယ့္ Debuff (Silence, Slow, etc..) ေတြကုိ ဖယ္ရွားႏုိင္တဲ့အျပင္ Enemy ကုိ တုိက္ခုိက္တဲ့အခါမွာလည္း Mana Break ကုိလည္း ၃ ဆ ျဖစ္ေစဖုိ႔ အေထာက္အကူေပးတဲ့အတြက္ ျဖစ္ပါတယ္။ မိမိတုိ္က္ခုိက္မယ့္ Enemy Unit ေပၚကုိ Blink ခုန္ျပီးမွ Manta Style ကုိ အသုံးျပဳေပးဖုိ႔ေတာ့ လုိပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။"
	 	},
	 	{
			"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/620199361464269",
			"hero_name":"Bounty Hunter",
			"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/bounty_hunter_vert.jpg",
			"hero_role":"Melee - Escape - Nuker",
			"hero_detail":"V6.87 Patch Update မွာေတာ့ Hero မ်ားစြာကို Balance လုပ္ေပးခဲ့ေပမယ့္ ယခုအခ်ိန္ထိ Pub တစ္ခုလုံးကုိ ေမႊေႏွာက္လုိ႔ ေကာင္းဆဲျဖစ္တဲ့ Core Support Hero တစ္ေကာင္ကိုေတာ့ ေထြေထြထူးထူး ေျပာင္းလဲျခင္း မရွိေသးပါဘူး။ အဆုိပါ Hero ကေတာ့ 5k အထက္မွာ ဒုတိယေျမာက္ Win Rate အေကာင္းဆုံး Hero အျဖစ္ ရပ္တည္လ်က္ရွိတဲ့အျပင္ Pub သာမက Premium တန္း ျပဳိင္ပြဲေတြမွာပါ ခက္စိပ္စိပ္ ျမင္ေတြ႕ရေနတဲ့ Gondar The Bounty Hunter ပဲျဖစ္ပါတယ္။ MMR Pusher ေတြ အသုံးျပဳေလ့ရွိတဲ့ Alchemist ဟာ ယခုေျပာင္းလဲသြားတဲ့ Ranked All Pick Mode မွာဆုိရင္ ကစားပြဲတုိင္းနီးပါး Ban ခံရတဲ့ Hero စာရင္းထဲမွာ ပါေလ့ရွိပါတယ္။ သူ႔ရဲ႕ ထိန္းသိမ္းရခက္ခဲတဲ့ Gold ရရွိမႈေၾကာင့္ Over ျဖစ္ေနတဲ့ Hero တစ္ေကာင္ျဖစ္သလုိ Gondar ရဲ႕ Ultimate Track ဟာလည္း Click တစ္ခ်က္တည္းနဲ႕ သိသာတဲ့ Team AoE Gold ကုိ ရရွိေစမွာျဖစ္လုိ႔ သြယ္ဝုိက္ေသာ Overpower Hero တစ္ေကာင္အျဖစ္ သတ္မွတ္လုိ႔ရပါတယ္။",
			"hero_overview":"Frozen Throne Dota တုန္းက Gondar ရဲ႕ Ability Build ဟာ Carry ဆန္တဲ့ ဖြဲ႕စည္းပုံ ျဖစ္ခဲ့ပါတယ္။ လက္ရွိမွာေတာ့ Gondar ရဲ႕ ဖြဲ႕စည္းပုံက Support, Ganker ပုံစံနဲ႕ ပုိျပီး လုိက္ဖက္တာကုိ ေတြ႕ရပါတယ္။ Cast Range 400 ပဲ ရွိတဲ့ Shuriken Toss ဟာ တကယ္ေတာ့ Range 1200 အကြာအေဝးက Enemy ကုိ သြယ္ဝုိက္ျပီး တုိက္ခုိက္လုိ႔ရပါတယ္။ မိမိတုိက္ခုိက္လုိတဲ့ Enemy Hero ကုိ Track တင္ျပီးတာနဲ႕ မိမိနဲ႕ နီးစပ္ရာက Enemy Unit တစ္ခုခုကုိ Shuriken ပစ္လုိက္တာနဲ႕ Track ရဲ႕ Bounce ေၾကာင့္ အဆုိပါ Unit ဆီကုိ ခုန္သြားမယ့္ အားသာခ်က္ကုိ ေမ့မထားသင့္ပါဘူး။ တကယ္လုိ႔ သင္က Aether Lens ကုိ ေရြးခ်ယ္ခဲ့မယ္ဆုိရင္ေတာ့ 1400 Range က Unit အထိ တုိက္ခုိက္ႏုိင္မယ့္ အျပင္ 394 Damage အထိေတာင္ သတ္ေရာက္ႏုိင္ဦးမွာျဖစ္ပါတယ္။ Jinada ကေတာ့ အေစာပုိင္းမွာ အေလာတၾကီး တင္စရာမလုိတဲ့ Ability ျဖစ္ပါတယ္။ အေစာပုိင္း Dps နည္းတုန္းမွာ Critical Rate ဟာ Support Hero တစ္ေကာင္အတြက္ အဓိက မလုိအပ္ေသးပါဘူး။ Cooldown ထက္ Duration အျမဲတမ္းမ်ားေလ့ရွိတဲ့ Shadow Walk ကုိေတာ့ ဒုတိယ ဦးစားေပးတင္သင့္ပါတယ္။ သူ႔ရဲ႕ Backstab Damage ဟာ မ်ားမ်ားယူေလ တုိးလာေလ ျဖစ္တဲ့အျပင္ Fade Time လည္း နည္းသြားမွာျဖစ္လုိ႔ ပြဲအေျခအေနကုိ ၾကည့္ျပီး Gondar ကုိ မပင္မပန္းပဲ Team Fight တစ္ခုကေန ပုိက္ဆံ ခ်မ္းသာေစမွာျဖစ္လုိ႔ Track ကိုေတာ့ အေျခအေနေပးတာနဲ႕ ရရင္ရသလုိ အသုံးျပဳေပးသင့္ပါတယ္။ကစားပြဲအေစာပုိင္းမွာ Gondar ရဲ႕ Inventory ထဲ ရွိေနသင့္တဲ့ Item ေတြကေတာ့ Orb of Venom, Quelling Blade, Blight Stone, Magic Stick, Urn, Bracer တုိ႔ပဲ ျဖစ္ပါတယ္။ တစ္ဖက္အသင္းက Gondar ကုိ ကာကြယ္ဖုိ႔ Sentry ႏုိင္ႏုိင္သုံးတတ္တဲ့ Enemy မ်ဴိးဆုိရင္ေတာ့ မိမိက လက္ဦးေအာင္ Deward လုပ္ဖုိ႔ Quelling Blade ကုိ လုိအပ္ပါတယ္။ Roamer တစ္ေကာင္အေနနဲ႕လည္း Quelling Blade ကုိ လက္ထဲ ကုိင္ထားသင့္ပါတယ္။ Gank တဲ့အခါမွာလည္း Jinada ကေန ရရွိတဲ့ MS Slow အျပင္ Orb of Venom က ရရွိမယ့္ Slow ကုိပါ ထပ္ေပါင္းေပးႏုိင္ရင္ ပုိထိေရာက္ပါလိမ့္မယ္။ Mid Game ေရြးခ်ယ္မႈအျဖစ္ Guardian Greaves က အေရးအၾကီးဆုံးျဖစ္ျပီး Drum, Mekansm, Medallion, Offering, Pipe, Crimson Guard စတဲ့ မိမိအသင္းအတြက္ အက်ဴိးျဖစ္မယ့္ Team Fight Item ေတြ အားလုံးကုိ Gondar အေနနဲ႕ တာဝန္ယူ ဆက္ေပးႏုိင္ပါတယ္။ Team Fight တုိင္းမွာ Track တင္ႏုိင္ေလေလ၊ ပုိက္ဆံရဖုိ႔ လြယ္ေလေလ ျဖစ္လုိ႔ Hard Support Hero မ်ား ဆက္ေပးဖုိ႔ ခက္ခဲတ့ဲ Item မ်ားကုိ Gondar က တာဝန္ယူႏုိင္ပါတယ္။ Linken, Lotus Orb, Vyse, Solar Crest, Dagger, Force Staff တုိ႔ကုိေတာ့ Situational Item မ်ားအျဖစ္ စဥ္းစားႏုိင္ပါတယ္။ Gondar ဟာ Melee Hero တစ္ေကာင္ျဖစ္ေပမယ့္ Battle တစ္ခုရဲ႕ အျပင္ကေန Position ေကာင္းေကာင္းနဲ႕ ေဆာ့လုိ႔ရတဲ့ Hero တစ္ေကာင္ဆုိတာကုိလည္း ေမ့မထားသင့္ပါဘူး။Gondar ဟာ Carry Build နဲ႕လည္း ေဆာ့လုိ႔ေကာင္းတဲ့ Hero တစ္ေကာင္ျဖစ္ပါတယ္။ ဒါေပမယ့္ Public Match ေတြမွာ Solo ေဆာ့ရင္ေတာ့ လက္ရွိ Ability Buil အရ Support Role ကပုိျပီး ထိေရာက္ပါတယ္။ IceFrog ဟာ ထင္ထားသလုိ Hero ေတြကုိ သိသိသာသာ Nerf ျခင္း မရွိေတာ့တဲ့အတြက္ Gondar ကုိ သင့္ရဲ႕ Solo MMR အတြက္ Spam ဖုိ႔ အခြင့္အေရးရွိပါေသးတယ္။ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။"
	 	},
		{
			"share_hero":"https://web.facebook.com/yahooyeehadotasuggestion/posts/622704954547043",
			"hero_name":"Nyx Assassin",
			"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/nyx_assassin_vert.jpg",
			"hero_role":"Melee - Disabler - Nuker - Initiator - Escape",
			"hero_detail":"ကစားပြဲတစ္ခုရဲ႕ အေျခအေနေပၚ မူတည္ျပီး Situational Item ေတြ စဥ္းစားရသလုိမ်ဴိး၊ ပြဲတစ္ခုရဲ႕အေျပာင္းအလဲကုိ အမွတ္မထင္တဲ့အေျခအေနမ်ဴိးမွာ ထုတ္သုံးရတဲ့ ဝွက္ဖဲလုိ Hero မ်ဴိးေတြ ရွိပါတယ္။ အဆုိပါ Hero မ်ားဟာ မၾကာခဏ Pick/ Ban ခံရေလ့ မရွိေပမယ့္ ပါဝင္လာတဲ့အခါမွာလည္း ကစားပဲြရဲ႕ အေျပာင္းအလဲကုိ မ်ားစြာ ေဆာင္က်ဥ္းေပးေလ့ရွိတဲ့အတြက္ အေရးပါတဲ့ အခန္းက႑က ပါဝင္ေလ့ရွိပါတယ္။ Pugna, Abaddon, Phoenix, Visage တုိ႔ကဲ့သုိ႔ Situational Hero မ်ားထဲက တစ္ေကာင္ျဖစ္တဲ့ Nyx Assassin ကေတာ့ ကစားသမားမ်ားနဲ႕ သိပ္မစိမ္းတဲ့ Melee Agility Hero တစ္ေကာင္လုိ႔ ေျပာလုိ႔ရပါတယ္။ Nyx Assassin ဟာ Ganker ေကာင္းတစ္ေကာင္ျဖစ္တဲ့အျပင္ နာမည္နဲ႕လုိက္ဖက္ေလာက္ေအာင္ Enemy Hero တစ္ေကာင္ကုိ တစ္ကုိယ္ေတာ္ ေခ်ာင္းေျမာင္းလုပ္ၾကံႏုိင္တဲ့ Roamer Ganker Hero တစ္ေကာင္လည္း ျဖစ္ပါတယ္။",
			"hero_overview":"Nyx Assassin ဟာ Ganker တစ္ေကာင္ျဖစ္ျပီး အထူးသျဖင့္ Hp Pool နည္းပါးတဲ့ Intelligence, Agility Hero ေတြကုိ တာဝန္ယူဖုိ႔ Pick ေလ့ရွိပါတယ္။ Nyx ရဲ႕ Ability ေတြကေန 260 + Avg 300 + 550 + Avg 100 = 1210 Damage ေလာက္အထိ အခ်ိန္တုိအတြင္းမွာ ထြက္ႏုိင္တဲ့အတြက္ Hero တစ္ေကာင္ကုိ ေဖ်ာက္ဖုိ႔ သုံးသလုိ ပုိေသခ်ာတဲ့ Damage output ကုိ ရရွိဖုိ႔ Dagon ကဲ့သုိ႔ Nuke Item ေတြကုိ ေယဘုယ် Build အျဖစ္ ေရြးခ်ယ္ေလ့ရွိပါတယ္။ Initiator, Ganker ေတြရဲ႕ ထုံးစံအတုိင္း Dagger, Force Staff, Eul Secpter တုိ႔ကုိ Battle တစ္ခုကုိ အစျပဳဖုိ႔အတြက္ ေရြးခ်ယ္ေလ့ရွိသလုိ Aghanim’s Scepter ရျပီးေနာက္မွာလည္း ေသခ်ာတဲ့ Spiked Carapace Stun ျဖင့္ တုိက္ခုိက္ႏုိင္ဖုိ႔ Dagger, Force Staff တုိ႔က အေထာက္အပံ့ေပးဦးမွာျဖစ္ပါတယ္။ လက္ရွိမွာေတာ့ Enemy Farmer တစ္ေကာင္ကုိ ထိန္းသိမ္းဖုိ႔ Global Caster Hero ေတြနဲ႕ တြဲျပီး ပြဲထုတ္ေလ့ရွိသလုိ လက္ရွိမွာေတာ့ အတြဲအမ်ားဆုံး Hero အေနနဲ႕ N’aix ကို ေတြ႕ရမွာျဖစ္ပါတယ္။ 2.25 seconds ရွိတဲ့ Spiked Carapace ကုိသုံးျပီး ထိပ္ဆုံးက ဝင္ေလ့ရွိတဲ့ Initiator ျဖစ္တဲ့အတြက္ Lotus Orb, Linken Sphere တုိ႔ကုိလည္း အေျခအေနအရ ေရြးခ်ယ္ႏုိင္ပါတယ္။ v6.67 မတုိင္ခင္ကာလမ်ားက Spiked Carapace ေၾကာင့္ Sange Yasha, Offering, Battle Fury ဆက္တဲ့ Carry Hero အျဖစ္ကုိ မျမင္ရတာၾကာျပီျဖစ္ေပမယ့္ လက္ရွိလူသုံးမ်ားေနတဲ့ Ganker, Initiator Hero တစ္ေကာင္ အျဖစ္က လက္ရွိ Meta နဲ႕ လုိက္ေလ်ာညီေထြမႈ အရွိဆုံးဆုိတာကုိ ျငင္းလုိ႔ မရပါဘူး။ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။"
		},
		{
			"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/647760752041463",
			"hero_name":"ENIGMA",
			"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/enigma_vert.jpg",
			"hero_role":"Ranged - Disabler - Jungler - Initiator - Pusher",
			"hero_detail":"Dota ဟာ သူမတူတဲ႕ Role ေပါင္းမ်ားစြာရွိေသာ Hero မ်ားနဲ႕ ဖြဲ႕စည္းထားသည့္ MOBA (Massive Online Battle Arena) Game တစ္ခုျဖစ္သည့္အေလွ်ာက္ ကစားပြဲတစ္ပြဲမွာ ပါဝင္လာမယ့္ Hero ေတြရဲ႕ အသုံး ဝင္ပုံဟာလည္း မ်ဴိးစုံကြဲျပားလ်က္ရွိပါတယ္။ Battle ကုိ ဦးစားေပး ကစားရတဲ့ Strategy Game တစ္ခုျဖစ္သည့္အေလွ်ာက္ Team Fight ေတြဟာ Dota ရဲ႕ အသက္ပဲ ျဖစ္ပါတယ္။ ဒီလုိ Team Fight တစ္ခုကေန ကစားပြဲတစ္ခုလုံးရဲ႕ ရလာဒ္ကုိ ေျပာင္းလဲသြားေစႏုိင္တဲ့ Ganker, Initiator အခ်ဴိ႕ရွိျပီး ၄င္းတုိ႔ထဲမွာမွ Intelligence Hero တစ္ေကာင္ျဖစ္တဲ့ Enigma ကေတာ့ Dota တစ္ခုလုံးရဲ႕ Strongest AoE Disable တစ္ခုကုိ ပုိင္ဆုိင္ထားတဲ့ Initiator Hero တစ္ေကာင္ပဲျဖစ္ပါတယ္။ Disable, Jungle, Push, Nuke စေသာ Ability ေကာင္းမ်ားစြာကုိ ပုိင္ဆုိင္ထားတဲ့ Enigma ရဲ႕ Black Hole တစ္လုံးဟာ ကစားပြဲတစ္ခုရဲ႕ အေျပာင္းအလဲကုိ မ်ားစြာ ျဖစ္သြားေစႏုိင္တဲ့အခ်က္က ျငင္းလုိ႔ မရတဲ့အတြက္ မိမိရဲ႕ Black Hole တစ္ခုစီတုိင္းကုိ အက်ဴိးရွိေစဖုိ႔ ပြဲစကတည္းက မိမိ BH ကုိ ဖ်က္ႏုိင္မယ့္ Disable ေတြကုိ ၾကဳိတင္ မွတ္သားထားျပီး Black Hole သုံးခါနီးတုိင္း မိမိကုိ ဖ်က္မယ့္ Disable ဘယ္ႏွစ္ခုကုန္သြားျပီလဲဆုိတာကုိ Overview ၾကည့္ႏုိင္ျပီး စိတ္ရွည္ဖုိ႔ အဓိက လုိအပ္ပါလိမ့္မယ္။ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။"
		 },
		 {
			"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/631344273683111",
		 	"hero_name":"Necrohpos",
		 	"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/necrolyte_vert.jpg",
		 	"hero_role":"Ranged - Carry - Nuker - Durable - Disabler",
			"hero_detail":"",
		 	"hero_overview":"Necrophos ကုိ Offlaner နဲ႕ Mid Laner အျဖစ္ အျမင္ရမ်ားေလ့ရွိျပီး Death Pulse ကုိ ဦးစားေပး တင္ေလ့ရွိတာကို ေတြ႕ရပါတယ္။ တစ္ခါတစ္ရံမွာ Offlaner Necrophos ေတြ အေနနဲ႕ Heartstopper ကုိ ဒုတိယ ဦးစားေပး တင္ေလ့ရွိေပမယ့္ ကစားပြဲအေစာပုိင္းမွာ Sadist ကုိ ဦးစြာတင္ဖုိ႔ အၾကံျပဳခ်င္ပါတယ္။ Sadist ဟာ Last Hit တစ္ခုလုပ္လုိက္တုိင္း HP MP ကုိ Regen ရေစမယ့္ အခ်က္က Necrophos ကုိ အေစာပုိင္းမွာ Mana Regen Item ေတြ ထည့္မစဥ္းစားဖုိ႔ အခြင့္အေရးရေစပါတယ္။ တကယ္လုိ႔ သင္က lvl 9 မွာ Sadist ကုိ Max ျဖစ္ေအာင္ တင္ခဲ့မယ္ဆုိရင္ မိနစ္ ၂ဝ မတုိင္ခင္ Team Fight ေတြမွာ Hero တစ္ေကာင္ Kill ႏုိင္တာနဲ႕ 360 Heal + 720 Mana Restore ဆုိတဲ့ မ်ားျပားေသာ Effective HP, MP ကုိ ရရွိေစမယ့္ အတြက္ျဖစ္ပါတယ္။ Heartstopper ဟာ အလြန္ထိေရာက္တဲ့ Aura တစ္ခုျဖစ္ေပမယ့္ ၄င္းဟာ % Calculation ျဖစ္ပါတယ္။ ဒါေၾကာင့္ အေစာပုိင္း Enemy Hero ေတြ ေသြးနည္းေနခ်ိန္မွာလည္း Dps နည္းနည္းပဲ ထိဦးမွာျဖစ္လုိ႔ AFK Jungle ေဆာ့တဲ့ (သုိ႔မဟုတ္) Aggressive Tri Offlane ေဆာ့တဲ့ Necrophos မဟုတ္ရင္ အေစာပုိင္းမွာ မ်ားမ်ား တင္ထားလည္း သိပ္ေတာ့ မထိေရာက္ပါဘူး။ (သုိ႔ေပမယ့္ ရံဖန္ရံခါမွာ Aggressive Mid Laner ေတြနဲ႕ ေဆာ့ရတဲ့အခါမ်ဴိး (ဥပမာ Outworld Devourer, TA) မွာ Heartstopper ကုိ မ်ားမ်ားယူျပီး ထိန္းရတဲ့ အေျခအေနမ်ဴိးရွိပါတယ္။) Sadist ကုိ ေရြးခ်ယ္ထားျခင္းေၾကာင့္ Dagon, Dagger, Force Staff, Blade Mail အစရွိတဲ့ Situational Item ေတြကုိ အေစာပုိင္းကတည္းက ေရြးခ်ယ္ႏုိင္ပါလိမ့္မယ္။Reaper’s Scythe ရဲ႕ အဓိက အားနည္းခ်က္ဟာ 600 သာရွိတဲ့ Cast Range ပဲျဖစ္ပါတယ္။ ဒါေၾကာင့္ အေစာပုိင္းမွာ Force Staff, Dagger တစ္ခုခုကို ေရြးခ်ယ္ႏုိင္ျပီး Aether Lens ဟာလည္း Situational Item တစ္ခု ျဖစ္ပါလိမ့္မယ္။ Reaper’s Scythe အသုံးျပဳျပီး 1.5 seconds ၾကာမွ Damage တြက္ခ်က္သက္ေရာက္မွာျဖစ္လုိ႔ Dagon နဲ႕ တြဲဖက္ျပီး အသုံးျပဳတာကေတာ့ အျမင္ရအမ်ားဆုံး ကစားပုံျဖစ္ပါတယ္။ ဒီလုိ Reaper’s Scythe အသုံးျပဳထားတဲ့ 1.5 seconds မွာမွ အဆုိပါ Hero ကုိ Lotus Orb တင္ေပးမယ္ဆုိရင္ Damage ဟာ Necrophos ကုိ ျပန္လည္ သတ္ေရာက္ေစမွာ မဟုတ္ပါဘူး။ (Lotus Orb သုံးထားျပီးသား Unit ေပၚကုိ Reaper’s Scythe သုံးမွသာ ျပန္ထိမွာျဖစ္ပါတယ္။) မိမိ Ally Hero တစ္ေကာင္ေကာင္ကုိ Reaper’s Scythe အသုံးျပဳခံေနရတဲ့အခ်ိန္မွာ Glimmer Cape တင္ေပးျခင္းက အေကာင္းဆုံး Counter ျဖစ္ပါတယ္။ အေၾကာင္းက Glimmer Cape မွာ 45% Magic Resistance ပါဝင္တဲ့အတြက္ Reaper’s Scythe ရဲ႕ Damage Output ကုိ သိသာစြာ ေလွ်ာ့ခ်ေပးမွာျဖစ္ပါတယ္။ မ်ားေသာအားျဖင့္ ကစားပြဲၾကာျမင့္လာေလေလ Necrophos ပါဝင္တဲ့အသင္းက ႏုိင္ဖုိ႔ အခြင့္အေရးရွိေလ ျဖစ္ပါတယ္။ အေၾကာင္းက Aghanim’s Scepter + Refresher Orb ကုိ အသုံးျပဳျပီး Enemy Team က Hero ၂ ေကာင္ေလာက္ကုိ လုံးဝ Buyback ထြက္လုိ႔ မရေအာင္ လုပ္ပစ္ႏုိင္တဲ့ Overpower အေျခအေန တစ္ရပ္ကုိ ပုိင္ဆုိင္ထားတဲ့အတြက္ပဲျဖစ္ပါတယ္။ Item အေနနဲ႕လည္း မ်ားစြာ ေရြးခ်ယ္ႏုိင္ပါတယ္။ ဖိနပ္ျပီးတာနဲ႕ Bloodstone တန္းထည့္တဲ့ Aggressive Durable Style, Blade Mail + Force Staff နဲ႕ Battle လုိက္တဲ့ Aggressive Initiator Style, Dagon + Aghanim’s နဲ႕ Carry Style, Guardian Greaves + Pipe နဲ႕ Support Style စ သျဖင့္ မရုိးႏုိင္ေသာ Play Style ေပါင္းမ်ားစြာ၊ ေရြးခ်ယ္စရာ Item ေပါင္းမ်ားစြာနဲ႕ ျပီးျပည့္စုံတဲ့ Flexible Intelligence Hero တစ္ေကာင္ပဲ ျဖစ္ပါေတာ့တယ္။ဒီလုိ အေၾကာင္းျပခ်က္ေပါင္း မ်ားစြာေၾကာင့္ပဲ Rotund’Jere The Necrophos ဟာ Pub Stomper တစ္ေကာင္အျဖစ္ အခ်ိန္ၾကာျမင့္စြာ ရပ္တည္ေနႏုိင္တဲ့ Hero တစ္ေကာင္ဆုိတာ ျငင္းလုိ႔မရပါဘူး။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။"
		 },
		 {
			"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/604433353040870",
			"hero_name":"Shadow Demon",
			"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/shadow_demon_vert.jpg",
			"hero_role":"Ranged - Support - Disabler - Initiator - Nuker",
			"hero_detail":"လက္ရွိ Meta မွာ Pub Match ေတြမွာ အဆုိးရြားဆုံး ဒုကၡေပးေနတဲ့ Hero တစ္ေကာင္လုိ႔ ေျပာလုိက္ရင္ Spectre ကုိ ဦးစြာ ေျပးျမင္မိမွာ ေသခ်ာပါတယ္။ အျခား Intelligence Hero တစ္ေကာင္ျဖစ္တဲ့ Outworld Devourer ဟာလည္း Overpower ျဖစ္ေနတယ္ဆုိေပမယ့္ Pub Match ေတြမွာေတာ့ Spectre ေလာက္ ဆုိးဆုိးရြားရြား Pub Stomper တစ္ေကာင္မျဖစ္ေသးပါဘူး။ ဒါေၾကာင့္ Spectre ကုိ Counter လုပ္တဲ့အခါမွာ မ်ားေသာအားျဖင့္ Slow Ability Caster ေတြဟာ အသုံးဝင္ေလ့ရွိျပီး Spectre ရဲ႕ Passive ေတြကုိပါ ရပ္တန္႔ေစမယ့္ Support Hero တစ္ေကာင္ကေတာ့ The Shadow Demon ပဲ ျဖစ္ပါတယ္။ Shadow Demon ဟာ Dota 2 Hero ေပါင္း ၁၁၁ ေကာင္မွာ ေပၚျပဴလာျဖစ္မႈ နံပါတ္စဥ္ ၁ဝ၇ သာ ခ်ိတ္တာကို ေတြ႕ရပါလိမ့္မယ္။ Pubber အမ်ားစုဟာ ရုိးရွင္းတဲ့ Disable, ရုိးရွင္းတဲ့ Nuke, ရုိးရွင္းတဲ့ Carry ေတြကုိ အၾကဳိက္မ်ားေလ့ရွိတဲ့အတြက္ Shadow Demon လုိမ်ဴိး Pure Support Hero တစ္ေကာင္ဟာ လူၾကဳိက္သိပ္မမ်ားဘူးဆုိေပမယ့္ Early Game နဲ႕ Mid Game မွာ Strong ျဖစ္တဲ့ Hero တစ္ေကာင္ဆုိတာေတာ့ ျငင္းလုိ႔ မရပါဘူး။ တကယ္လုိ႔ သင္ဟာ Support Player တစ္ေယာက္ ဒါမွမဟုတ္ Mid Player တစ္ေယာက္ျဖစ္ေနခဲ့မယ္ဆုိရင္ေတာ့ Shadow Demon ကုိ သင္ေရြးခ်ယ္ရမယ့္ Hero List ထဲမွာ ထည့္သြင္းစဥ္းစားဖုိ႔ အၾကံျပဳလုိပါတယ္။\nItem Build\nShadow Demon ဟာ ရုတ္တရက္ၾကည့္ရင္ Mana Cost အေျမာက္အမ်ားလုိတယ္လုိ႔ ထင္ရေပမယ့္ သင့္ေတာ္တဲ့ Mana Regeneration သာ ရွိမယ္ဆုိရင္ သူ႔ရဲ႕ Ability ေတြဟာ Battle တစ္ခုအတြက္ လံုေလာက္တဲ့ ပမာဏကုိ ပုိင္ဆုိင္ျပီးသားျဖစ္ပါတယ္။ ဒါေၾကာင့္ ဖိနပ္အတြက္ Tranquil Boots ကုိ ေရြးခ်ယ္ျခင္းက ပုိမုိ အသုံးတည့္ေစျပီး ဒုတိယ Item အျဖစ္ Aether Lens ကုိ အၾကံျပဳခ်င္ပါတယ္။ Urn နဲ႕ Force staff ကေတာ့ Support Hero တစ္ေကာင္အတြက္ Escape နဲ႕ Save အတြက္ အသုံးျပဳဖုိ႔ အေထာက္အကူ ျပဳေစတာကိုပါလိမ့္မယ္။ Dagger, Rod of Atos, Eul Scepter, Mekansm, Pipe, Necronomicon တုိ႔ကေတာ့ ပြဲအေျခအေနေပၚမူတည္၍ ေရြးခ်ယ္ႏုိင္ျပီး Aghanim's ကေတာ့ Late Game Counter အတြက္ လြန္စြာ အေရးၾကီးတဲ့ Item တစ္ခုအျဖစ္ စဥ္းစားႏုိင္ပါတယ္။",
			"hero_overview":"Shadow Demon ရဲ႕ Shadow Poison ကေတာ့ မ်ားျပားတဲ့ Damage ပမာဏကုိ ေပးမယ့္ Nuke Ability ဆုိတာ ေဖာ္ျပျပီးျဖစ္ပါတယ္။ ဒါေၾကာင့္ တစ္ဖက္အသင္းမွာ မိမိအသင္းကုိ ဒုကၡေပးမယ့္ Mid Laner တစ္ေကာင္ေကာင္ (DP, OD, Zeus, etc... ) လာမယ္ဆုိရင္ Shadow Demon ရဲ႕ Long Range Shadow Poison နဲ႕ Counter ျပန္ေထာက္ျပီး Mid Lane ပုံစံနဲ႕ ျပန္ထိန္းႏုိင္ပါတယ္။ ဒါအျပင္ Mid Lane Hero နဲ႕ ေဆာ့တဲ့အခါမွာ Neutral Creep Camp Stack တစ္ခုကုိ စားဖုိ႔ 12.5 Seconds ၾကာျမင့္တဲ့ Shadow Poison 5 Stacks ျဖင့္ အလြယ္တကူ Creep စားႏုိင္ဦးမွာျဖစ္ပါတယ္။ Disruption ရဲ႕ ထူးျခားခ်က္ကေတာ့ Illusion Unit ေတြအေပၚမွာ အသုံးျပဳႏုိင္ျခင္းပဲျဖစ္ပါတယ္။ ျဖစ္ေပၚလာတဲ့ Illusion ၂ ေကာင္ရဲ႕ Damage Output ဟာ Illsion Unit ေပၚတြက္ခ်က္ျခင္းမဟုတ္ဘဲ ပုိင္ရွင္ Hero အစစ္ရဲ႕ Damage ပမာဏအတုိင္း တြက္ခ်က္တာျဖစ္လုိ႔ Spectre ရဲ႕ Ultimate Haunt Illusion လိုမ်ဴိး Illusion ေပၚကုိ အသုံးျပဳေပးတာနဲ႕ မူလ Spectre ရဲ႕ 60% Damage Output ၂ ေကာင္ကို ရရွိေစမွာျဖစ္ပါတယ္။ ဒါ့အျပင္ မိမိအသင္းက Hard Carry ကုိ အသုံးျပဳေပးရင္လည္း Manta Style ထက္ ၇.၅ ဆ ပုိေကာင္းတဲ့ Illusion Unit ႏွစ္ခု ကုိ ရရွိေစမယ့္ အခ်က္ကုိလည္း ေမ့မထားသင့္ပါဘူး။Shadow Demon ဟာ Early Game နဲ႕ Aghanim's ထြက္ျပီး Late Game မွာ မ်ားစြာ အသုံးဝင္ပါတယ္။ Damage တစ္ခုကုိ တုိက္ရုိက္မထိဘဲ သြယ္ဝုိက္ကာ အခ်ိန္အတုိင္းအတာ တစ္ခုထိ ေစာင့္ေပးရတဲ့ အားနည္းခ်က္ေၾကာင့္ လူၾကဳိက္နည္းေနရတာ ျဖစ္ေပမယ့္ တကယ္တမ္း အသုံးဝင္တဲ့ Hero တစ္ေကာင္ဆုိတာေတာ့ ျငင္းလို႔ မရပါဘူး။ Shadow Demon ရဲ႕ အသုံးဝင္မႈဟာ သူ႔ကို ကုိင္တြယ္ကစားမယ့္ ကစားသမားရဲ႕ ပါးနပ္မႈေပၚကုိ မ်ားစြာ မူတည္ပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။"
		 }

	]
}